app/controllers/home_controller.rb

  def index
    all_products = Product.where('on_index = 1').includes(:variants)
---
SELECT `products`.* FROM `products` WHERE (products.deleted_at is NULL) AND (products.available_on <= '2012-07-23 17:15:29')
SELECT `variants`.* FROM `variants` WHERE (`variants`.product_id IN (1,2,3) AND (variants.is_master = 1 AND variants.deleted_at IS NULL))