app/controllers/home_controller.rb

  def index
    @collections = Taxonomy.find(1).root.children
    @brands = Taxonomy.find(2).root.children

    @searcher = Spree::Config.searcher_class.new(params)
    @products = @searcher.retrieve_products
    @product = @products.first
---
SELECT `taxonomies`.* FROM `taxonomies` WHERE `taxonomies`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products` WHERE (products.deleted_at is NULL) AND (products.available_on <= '2012-07-23 16:29:11') LIMIT 9 OFFSET 0