app/controllers/orders_controller.rb

SELECT `variants`.* FROM `variants` WHERE `variants`.`id` = 3 LIMIT 1
UPDATE `orders` SET `payment_state` = 'pending', `shipment_state` = NULL, `item_total` = 2100.0, `adjustment_total` = 0.0, `payment_total` = 0.0, `total` = 2100.0 WHERE `orders`.`id` = 1
---
  def populate
    @order = current_order(true)

    params[:products].each do |product_id,variant_id|
      quantity = params[:quantity].to_i if !params[:quantity].is_a?(Hash)
      quantity = params[:quantity][variant_id].to_i if params[:quantity].is_a?(Hash)
      @order.add_variant(Variant.find(variant_id), quantity) if quantity > 0
    end if params[:products]

    params[:variants].each do |variant_id, quantity|
      quantity = quantity.to_i
      @order.add_variant(Variant.find(variant_id), quantity) if quantity > 0
    end if params[:variants]

    @order.update_totals