app/controllers/products_controller.rb

  def index
    if params.has_key?("product_group_name") then
      product_group_name = params["product_group_name"]
      product_group = ProductGroup.where('permalink = ?', product_group_name)[0]
      all_products = product_group.products
    end

    #такой странный и запутанный этот spree
    all_products_by_gender = {"male" => [], "female" => []}
    all_products.each do|product|
---
SELECT `products`.* FROM `products` ORDER BY created_at DESC

  def show
    @product = Product.find_by_permalink!(params[:id])
    return unless @product

    @variants = Variant.active.includes([:option_values, :images]).where(:product_id => @product.id)
---
SELECT `products`.* FROM `products` WHERE `products`.`permalink` = 'keds-white' LIMIT 1
SELECT `variants`.* FROM `variants` WHERE (`variants`.product_id = 3 AND (variants.is_master = 1 AND variants.deleted_at IS NULL)) LIMIT 1