app/controllers/taxons_controller.rb

  def show
    all_collection_id = 5 #грязный грязный хак

    @taxon = Taxon.find_by_permalink!(params[:id])
---
SELECT `taxons`.* FROM `taxons` WHERE `taxons`.`permalink` = 'kollektsii/osen-zima' LIMIT 1